app/views/users/edit.html.erb

<%= form_with(model: @user) do |form| %>
    <%= form.collection_check_boxes :role_ids, Role.all, :id, :name %>
---
SELECT "roles".* FROM "roles"