app/controllers/provas_controller.rb

  def index
    @provas = Prova.all
---
SELECT "provas".* FROM "provas"

  def create
    #@prova = Prova.new(prova_params)

    if Prova.joins(:current_user).where(provas: { em_edicao: true }).count == 0
      @prova = current_user.provas.build(prova_params)
    end


    respond_to do |format|
      if @prova.save
---
INSERT INTO "provas" ("titulo", "instrucoes", "created_at", "updated_at", "user_id", "resposta", "done") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["titulo", ""], ["instrucoes", "false"], ["created_at", "2022-12-05 00:45:43.528510"], ["updated_at", "2022-12-05 00:45:43.528510"], ["user_id", 8], ["resposta", nil], ["done", nil]]

  def update
    respond_to do |format|
      if @prova.update(prova_params)
---
UPDATE "provas" SET "titulo" = $1, "instrucoes" = $2, "updated_at" = $3, "user_id" = $4, "nota" = $5 WHERE "provas"."id" = $6  [["titulo", "Prova de MVGA"], ["instrucoes", ""], ["updated_at", "2022-12-05 01:56:59.306316"], ["user_id", 8], ["nota", "10.0"], ["id", 23]]

  def destroy
    @prova.destroy
---
DELETE FROM "provas" WHERE "provas"."id" = $1  [["id", 1]]

  def correct_user
    @prova = current_user.provas.find_by(id: params[:id])
---
SELECT "provas".* FROM "provas" WHERE "provas"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

    def set_prova
      @prova = Prova.find(params[:id])
---
SELECT "provas".* FROM "provas" WHERE "provas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]