app/controllers/questaos_controller.rb

SELECT "questaos".* FROM "questaos"
---
  def index
    @questaos = Questao.all

INSERT INTO "questaos" ("pergunta", "created_at", "updated_at") VALUES (?, ?, ?)  [["pergunta", "Qual é a estrutura básica HTML?"], ["created_at", "2022-10-16 21:43:41.925377"], ["updated_at", "2022-10-16 21:43:41.925377"]]
---
  def create
    @questao = Questao.new(questao_params)

    respond_to do |format|
      if @questao.save

UPDATE "questaos" SET "pergunta" = $1, "updated_at" = $2 WHERE "questaos"."id" = $3  [["pergunta", "teste2"], ["updated_at", "2022-12-05 00:26:14.161410"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @questao.update(questao_params)

DELETE FROM "questaos" WHERE "questaos"."id" = $1  [["id", 3]]
---
  def destroy
    @questao.destroy

SELECT "questaos".* FROM "questaos" WHERE "questaos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_questao
      @questao = Questao.find(params[:id])